package medium

/*
给你一个由 '1'（陆地）和 '0'（水）组成的的二维网格，请你计算网格中岛屿的数量。

岛屿总是被水包围，并且每座岛屿只能由水平方向和/或竖直方向上相邻的陆地连接形成。

此外，你可以假设该网格的四条边均被水包围。

示例 1：

输入：grid = [

	['1','1','1','1','0'],
	['1','1','0','1','0'],
	['1','1','0','0','0'],
	['0','0','0','0','0']

]
输出：1
示例 2：

输入：grid = [

	['1','1','0','0','0'],
	['1','1','0','0','0'],
	['0','0','1','0','0'],
	['0','0','0','1','1']

]
输出：3
*/
func numIslands(grid [][]byte) int {
	row := len(grid)
	col := len(grid[0])
	res := 0
	var dfs func(i, j int)

	// 染色
	dfs = func(i, j int) {
		if i < 0 || i >= row || j < 0 || j >= col || grid[i][j] != '1' {
			return
		}
		grid[i][j] = '2'
		dfs(i+1, j) // 下
		dfs(i-1, j) // 上
		dfs(i, j+1) // 右
		dfs(i, j-1) // 左
	}

	for i := 0; i < row; i++ {
		for j := 0; j < col; j++ {
			if grid[i][j] == '1' {
				res++
				dfs(i, j)
			}
		}
	}
	return res
}
